# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'neovim/neovim'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'railwaycat/emacsmacport'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'xs' # dependency for python3
brew 'ack'
brew 'awscli'
brew 'cmake'
brew 'curl'
brew 'ffmpeg'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'git-lfs'
brew 'hub'
brew 'httpie'
brew 'jenv'
brew 'pandoc'
brew 'python3'
brew 'mackup'
brew 'mas'
brew 'neovim/neovim/neovim'
brew 'node'
brew 'pdsh'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'rg'
brew 'sbt'
brew 'scala'
brew 'scalastyle'
brew 'thefuck'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'trash'
brew 'tree'
brew 'wget', args: ['with-iri']
brew 'emacs-mac', args: ['with-spacemacs-icon']

# Apps
cask 'aerial'
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'ksdiff'
cask 'postman'
cask 'quip'
cask 'sequel-pro'
cask 'sizeup'
cask 'slack'
cask 'sublime-text'
cask 'skype'
cask 'tower'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'iina'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-hack'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'install font-hack-nerd-font'

# Install Mac App Store apps
mas 'Dash', id: 449589707
mas 'Fantastical 2', id: 975937182
mas 'Kaleidoscope', id: 587512244
mas 'Marked 2', id: 890031187
mas 'Patterns', id: 429449079
mas 'Pixelmator', id: 407963104
mas 'Sip', id: 507257563
mas 'Quiver', id: 866773894
