# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'aws/tap'

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# Install Binaries
brew 'openssl'
brew 'ack'
brew 'awscli'
brew 'cmake'
brew 'curl'
brew 'ffmpeg'
brew 'fish'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'git-lfs'
brew 'glances'
brew 'go'
brew 'hub'
brew 'httpie'
brew 'ipcalc'
brew 'jenv'
brew 'pandoc'
brew 'python'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'mas'
brew 'neofetch'
brew 'node'
brew 'reattach-to-user-namespace'
brew 'rustup-init'
brew 'stow'
brew 'thefuck'
brew 'telnet'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

# Rust Tooling
brew 'bandwhich' # Terminal bandwidth utilization tool
brew 'bat' # A replacement for cat
brew 'bottom' # Yet another cross-platform graphical process/system monitor
brew 'git-delta' # A syntax-highlighting pager for git, diff, and grep output
brew 'dog' # Command-line DNS client (dig alternative)
brew 'dust' # A more intuitive version of du
brew 'eza' # A modern version of ls
brew 'fd' # A simple, fast and user-friendly alternative to find
brew 'helix' # A post-modern modal text editor
brew 'ripgrep' # A faster replacement for GNU’s grep command
brew 'sd' # Intuitive find & replace CLI (sed alternative)
brew 'starship' # Customizable prompt for any shell
brew 'tealdeer' # A very fast implementation of tldr
brew 'xh' # Friendly and fast tool for sending HTTP requests
brew 'zellij' # Pluggable terminal workspace (tmux alternative)
brew 'zoxide' # A smarter cd command

# Apps
cask '1password'
cask 'appcleaner'
cask 'dash'
cask 'postman'
cask 'iina'
cask "imageoptim"
cask 'keka'
cask 'orbstack'
cask 'raycast'
cask 'visual-studio-code'
cask 'warp'
cask 'zed'

# Fonts
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask "font-cascadia-mono-pl"
cask 'font-caskaydia-cove-nerd-font'

# Install Mac App Store apps
mas "ColorSlurp", id: 1287239339
mas "DaisyDisk", id: 411643860
mas "Kaleidoscope", id: 587512244
mas "Magnet", id: 441258766
mas "Velkja", id: 1607635845
